zuorasoap/zuorasoap-connector/zuorasoap-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/zuorasoap/apiQueryMoreMandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:urn="http://api.zuora.com/">
    <soapenv:Header>
        <urn:SessionHeader>
            <urn:session>%s(session)</urn:session>
        </urn:SessionHeader>
        <urn:QueryOptions>
            <urn:batchSize>%s(batchSize)</urn:batchSize>
            <urn:caseSensitive>false</urn:caseSensitive>
        </urn:QueryOptions>
    </soapenv:Header>
    <soapenv:Body>
        <urn:queryMore>
            <urn:queryLocator>%s(queryLocator)</urn:queryLocator>
        </urn:queryMore>
    </soapenv:Body>
</soapenv:Envelope>